Synwit-Co-Ltd/SWM260_Lib/Clock/ClockSwitch/APP/main.c
#include "SWM260.h"


void SerialInit(void);
void SystemInit_72MHz(void);

int main(void)
{
	uint32_t i;
	
	SystemInit();
	
	SerialInit();
   	
	printf("SystemCoreClock = %dMHz\r\n", SystemCoreClock/1000000);
	
	while(1==1)
	{
		SystemInit_72MHz();
		
		UART_SetBaudrate(UART0, 57600);		// 切换系统主频后需要重新配置波特率
		
		for(i = 0; i < 4; i++)
		{
			printf("SystemCoreClock = %dMHz\r\n", SystemCoreClock/1000000);
			
			SW_DelayMS(500);
		}
		
		SystemInit();
		
		UART_SetBaudrate(UART0, 57600);
		
		for(i = 0; i < 4; i++)
		{
			printf("SystemCoreClock = %dMHz\r\n", SystemCoreClock/1000000);
			
			SW_DelayMS(500);
		}
	}
}


void SystemInit_72MHz(void)
{
	switchToPLL(0, 6, 36, PLL_OUT_DIV8, 0);
	
	SystemCoreClockUpdate();
}


void SerialInit(void)
{
	UART_InitStructure UART_initStruct;
	
	PORT_Init(PORTC, PIN13, PORTC_PIN13_UART0_TX, 0);	//GPIOC.13配置为UART0 TXD
	PORT_Init(PORTC, PIN14, PORTC_PIN14_UART0_RX, 1);	//GPIOC.14配置为UART0 RXD
 	
 	UART_initStruct.Baudrate = 57600;
	UART_initStruct.DataBits = UART_DATA_8BIT;
	UART_initStruct.Parity = UART_PARITY_NONE;
	UART_initStruct.StopBits = UART_STOP_1BIT;
	UART_initStruct.RXThreshold = 3;
	UART_initStruct.RXThresholdIEn = 0;
	UART_initStruct.TXThreshold = 3;
	UART_initStruct.TXThresholdIEn = 0;
	UART_initStruct.TimeoutTime = 10;
	UART_initStruct.TimeoutIEn = 0;
 	UART_Init(UART0, &UART_initStruct);
	UART_Open(UART0);
}

/****************************************************************************************************************************************** 
* 函数名称: fputc()
* 功能说明: printf()使用此函数完成实际的串口打印动作
* 输    入: int ch		要打印的字符
*			FILE *f		文件句柄
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
int fputc(int ch, FILE *f)
{
	UART_WriteByte(UART0, ch);
	
	while(UART_IsTXBusy(UART0));
 	
	return ch;
}
